---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.GetEnumerator
source: html/0e11141e-a7b0-28b1-eddd-11e42b8c3c55.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.